{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> Importer","text":"Weitere Informationen zum Modul Importer finden Sie in unserem Shop: https:\/\/www.oxidmodule.com","tags":"","url":"index.html"},{"title":"Changelog","text":"5.0.6.0 - (2021-07-08) Fixed Fehlerhafte Verwendung beim Aufruf von oxarticles behoben Import der Staffelpreise nun auch mit nicht ganzzahlige Werten möglich Probleme mit der Shop-ID behoben, die neue leere Artikel erzeugt hat 5.0.5.0 - (2021-05-03) Changed Installierbar in OXID 6.2.4 und 6.3 Adminmenüeintrag um Icon ergänzt fügt nur die konfigurierte Anzahl Importbilderfelder und -indizes zur Datenbank hinzu 5.0.4.2 - (2021-04-13) Fixed nicht funktionierendes Preisupdate bei EE-Subshops mit vererbten Preisen korrigiert Changed Hinweis für Preisimporte mit prozentualer Veränderung ergänzt Dokumentation aktualisiert 5.0.4.1 - (2020-11-30) Added Freigabe für OXID 6.2.3 Changed Shopid für Tabelle d3importconfig auf init(11) 5.0.4.0 - (2020-04-20) Added installierbar in OXID 6.2 Changed Abhängigkeiten für Installationen ohne Metapackage von OXID Metapackage zu Shop-Core geändert 5.0.3.0 - (2020-02-07) Added Composer installation supported Changed documentation adjusted fixed 0000000: external picture import runs endlessly when importing 10 or more images 5.0.2.0 0001991: Neue Option - Bilder im Importverzeichnis löschen, verschieben 0002805: neue Bildimportoption &quot;Master Bilder am Artikel erst löschen, dann importieren&quot; 0002002: Alle Update Checkboxen an\/abwählen 0007825: Mall Tab erlaubt keine Leer Möglichkeit 0000000: fixed category import add's a relationship with oxrootid if column is empty 0000000: refactored \\d3_importer_Application_Models_Models_Import_Article::setUpdate 0000000: refactored \\d3_importer_Application_Models_Models_Import_Article::setInsert 0000000: added methods in class \\d3_importer_Application_Models_Models_Import_Article: setArticleOxid, setRemindActiveFlag, addPriceFields 0000000: refactored collector -&gt; moved methods to importService: getCsvLines, addOxidToCSVData 0000000: added class \\d3_importer_Application_Models_Service_Import and modified constructor of \\d3_importer_Application_Models_Interface_Import + \\d3_importer_Application_Models_ImportAbstract 0000000: refactored import models &gt; moved method's getArticleRecords into \\d3_importer_Application_Models_Collector; the \\d3_importer_Application_Models_Collector assign's oxid's, if they are present in the database 0000000: added abstract class \\d3_importer_Application_Models_ImportAbstract for future refactorings in import models 0000000: added interface \\d3_importer_Application_Models_Interface_Import for future refactorings in import models 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Accessories::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Article::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Attributes::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Category::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Crossselling::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Mall::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Manufacturer::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Price2Article::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Selectlist::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored moved method \\d3_importer_Application_Models_Models_Import_Vendor::getImportFields \\d3_importer_Application_Controller_Import_Article::getImportFields 0000000: refactored variable names in \\d3_importer_Application_Controller_Import_Article::getImportFields 5.0.1.1 0008260: make it possible to import d3 content tabs fields 0008033: longdesc couldn't imported into variants 0000000: optical changes in picture import 0006221: articlefields will not translated into english 5.0.1.0 0007694: v6 after import &quot;delete\/deactivate articles&quot; doesn't work 0007613: &quot;deactivate articles&quot; overwrite values in table oxarticles 0007733: import scale prices absolute or percentally 0007759: crossselling and accessories works partially 0004280: verify EE compatibility 0000000: update demo importprofile + csv data 5.0.0.1 added 0000000: added exception empty if profile is empty changed 0000000: refactored template methods to template variables (templates d3_importer_main.tpl + erromessages.tpl) 0000000: closed resource handle 0000000: solved inspection code - results 0000000: reset metadata module id to d3importer 0000000: improve code (use getOne instead of getAll, reduced code) 0000000: replaced execute to getAll while using select query in category model 0000000: replaced select to delete query in deleteArticleAssign method in Selectlist model 0000000: removed unused deleteArticleAssign in vendor model 0000000: corrected some germans typo's 0000000: added notice for category import fixed 0000000: handling in d3_importer_cron.php doesn't work 0000000: importer fields in frontend (admin) 0000000: after import ticker 0006856: pictureimport: checkboxes will not saved 5.0.0.0 Minor version upgrade notice: there are some backward-incompatible changes to this release. 0005803: upgrade to oxid eShop version 6.0.0.0 0000000: drop support of oxid eShop version 4.10.x \/ 5.3.x 4.5.0.0 Minor version upgrade notice: there are some backward-incompatible changes to this release. 0000000: Modul wurde grundlegend überarbeitet 0006523: Zeitstempel und weitere Informationen im Cronjob hinzugefügt 0002014: nur EE: Profile in anderen Subshops ausblenden 0004280: EE testen und anpassen - Zuweisung Artikel 0006371: Textinfo &quot;Pflicht...Artikelnummer&quot; ist falsch 0000000: Leerwert für Artikelidentifikation hinzugefügt 0000000: Fehler in den &quot;ja&quot;\/&quot;nein&quot; Definition behoben 0000000: Button für den Bilderimport hinzugefügt 0000000: Mall Tab nutzt Formularbuilder 0000000: Altes Attributshandling wurde entfernt 4.4.2.0 0004766: Überarbeitung der automatischen Installation 0004836: Tags werden beim Importvorgang gekürzt 0000000: 4.8.x\/5.1.x wird nicht mehr unterstützt 0000000: unbenutzte Felder im Code entfernt 0000000: Sprachidents für d3importpic13-20 hinzugefügt 0005377: d3importerdesc editierbar machen 0005378: Felder für D3 Content Tabs im Importer aufnehmen 0004705: Zeilenumbrüche werden nicht erkannt v4.4.1.6 0004657: oxid als &quot;Auswahl für Artikelidentifikationsfelder&quot; nicht möglich 0004876: Leere Attribute werden angelegt 0004870: Import von Attributen: EE - Handling 0004487: nur 12 Bilder (bis oxpic12) statt 20 können beim Bilderimport verwendet werden 0004771: Navigation speichert Profil ab 0004506: doppelte Kategorien, Hersteller und Lieferanten bei Subsprache 4.4.1.6 0003728: seo URl's werden bei der Einstellung &quot;Artikel-Kat.-Zuordnungen vorher löschen&quot; nicht gelöscht 0003724: oxremindactive wird nicht aktualisiert 4.4.1.5 0003570: Vordefinierte Werte funktionieren nicht. 0003572: Fehlerhafte Zählung der aktualisierten Artikel im CronJob 0003681: min. Connector - Version auf 4.3.1.2 setzen 0003624: Hinweise deutlich sichtbarer, wenn eine Demolizenz benutzt wird 0003643: Templates durch Blöcke erweitern 4.4.1.4 Aufteilung der automatischen Installation Strukturänderung: Datei für das automatische Update von models nach setup verschoben fehlende Übersetzungen nachgetragen Hilfe-Link korrigiert Korrektur der automatischen Installation, Übernahme des bereits hinterlegten Lizenzschlüssels 4.4.1.3 Korrektur des Imports von Tags Korrektur zu Kategoriezuweisungen welche nicht übernommen wurden Fehler im Admin behoben - die erste CSV-Spalte konnte in der Kategoriezuweisung nicht abgespeichert werden. Korrektur dass alle Bilder beim Aufruf via Cronjob abgearbeitet werden 4.4.1.2 Inkompatibilität mit 4.9.0 behoben Hilfetext bei Auswahllisten korrigiert Fehler bei noch nicht gespeicherten Grundeinstellungen behoben Fehler im Cronjob behoben - Update entfernt Nachkommastellen bei Preisen mit , (Hinweis: der Cronjob nutzt nun den Admin Modus) 4.4.1.1 d3importflag von enum zu varchar(32) umgeändert Bugfix: Attribute wurden nicht importiert Demoprofil aktualisiert 4.4.1.0 neue mehrsprachige Attributszuordnungen inkl. Fallback Bugfix: im Demomodus werden Profile nicht mehr gespeichert, wenn die maximale Anzahl der Profile erreicht ist Wenn das Modul inaktiv ist, werden die Formulare gesperrt technische Verbesserungen im Quellcode 4.4.0.2 Bugfix: Bilder mit Umlauten werden nicht importiert Bugfix: Bei einem Update werden Preise mit , abgeschnitten Neue Grundeinstellung &quot;Auswahl für Kategorieidentifikationsfelder&quot; Bugfix: Import einer Kategorie ohne Namen, sobald ein Trennzeichen an letzter Stelle steht: &quot;Kat1,Kat2,Kat3,&quot; Bugfix: Bilder mit Sonderzeichen werden nicht importiert 4.4.0.1 Bugfix: defekte XML Profile (Importer &lt; 4.4.0.0) werden nicht migriert Bugfix: wenn MwSt leer importiert wird, wird nun null statt 0 geschrieben Bugfix: Export von Profilen korrigiert Beispiele von Conjob Shell Dateien für Profihost.com Server erweitert 4.4.0.0 Neues Feature Grundeinstellungen Neuer Menüpunkt Logging Neue Einstellungen für den Bilderimport technische Verbesserung im Admin Anzahl der Bilder wird aus der Shopconfiguration ausgelesen Logging &quot;externe Bilder einlesen&quot; implementiert Große CSV-Dateien werden im Admin performanter ausgelesen Auslagerung der Hilfetexte im Admin in ? - Boxen Übernahme der Importer-Smarty-Datei in das Modulverzeichnis externe Bilder werden anhand der Profil ID eingelesen Grosschreibung der Endung von CSV- \/ TXT-Dateien ermöglichen Bugfix: letzte Zeile der Importdatei importieren 4.3.3.1 Update der precheck.php 4.3.3.0 Zurücksetzen der Artikelanzahl in Kategorien, Lieferanten und Hersteller Bugfix für 4.8.3 Bugfix PHP 5.4-Kompatibilität hergestellt Bugfix nach Anlegen eines neuen Profils war das Profil nicht ausgewählt Bugfix Dateinamen für den Bilderimport auf 128 Zeichen (wie oxid Standard) festgelegt Testprofil und CSV Dateien wurden hinzugefügt 4.3.2.4 Bugfix im Bilderimport, lediglich ein Bild wurde importiert 4.3.2.3 Bugfix in der Demoversion beim Bearbeiten der Bilder 4.3.2.2 PHP 5.4-Kompatibilität hergestellt 4.3.2.1 Call By References entfernt (PHP 5.4-Kompatibilität) Installationsfehler korrigiert 4.3.2.0 Fehlermeldungen beim laden der Konfiguration werden abgefangen und unter Importer-&gt;Einstellungen-&gt;Stamm ausgegeben simple Exportfunktion für Importprofile unter Importer-&gt;Einstellungen-&gt;Stamm hinzugefügt (SQL basierend) Bugfix beim Speichern von Dateinamen mit Umlauten Bugfix Auslesen nicht zugeordneter Felder (im Tab Artikelfelder) verursachte einen Fatal Error Bugfix automatische Installation 4.3.1.2 Bugfix beim Einlesen der zu importierenden Bilder behoben (Admin fand nur 1 Bild) 4.3.1.1 Bugfix bei Import von Kategorien, welche nicht &quot;via Name&quot; importiert werden 4.3.1.0 automatische Installation eingefügt Aktivierung durch Seriennummern 4.3.0.0 komplette Überarbeitung des Moduls für die neue Shopstruktur des OXID eShop 4.7\/5.0 4.2.5.1 Modulversionsnummer und Vorschaubild im Admin korrigiert 4.2.5 Integration der Profil-ID bei bearbeiteten Artikeln. Damit Möglichkeit den &quot;Nach Import&quot; auf die vom Profil betroffenen Artikeln zu beschränken Erweiterung des externen Bilderimports um Fehlerbehandlung und Bildtypprüfung Änderung des Downloadverfahrens auf Curl für ein besseres Fehlerhandling Der externe Bilderimport geht nun nicht mehr in eine Endlosschleife wenn ungültige Urls importiert wurden 4.2.4 Nötige Änderungen für Shopversion 4.6.0 eingebaut Support für Shopversionen &lt; 4.2.0 entfernt Install-Doku überarbeitet 4.2.3 Fehler beim Zuordnen mehrerer Artikelbilder über verschiedene Bildslots zu einem Artikel behoben (Shopversion &lt; 4.5.0) kein Update der Langtexte bei älteren Shopversionen 4.2.2 Zusammenfassen bisheriger Bugfixes fehlende Bildslots in Shopversion &lt; 4.5.0 4.2.1 &quot;Nach Import&quot; konnte nicht korrekt gestartet werden Neuer Menüpunkt &quot;Einstellungen&quot; zur besseren Kontrolle der Modulversion Optimierung des Importvorgangs durch Indizierung diverser DB-Felder Button &quot;Neues Importprofil&quot; In älteren Template-Versionen wurden veraltete Smartyvariablen korrigiert ModId angepasst 4.2.0 Einbau eines Import-cronjobs Überarbeitung diverser Moduldateien für die cronjob-Funktionalität 4.1.7 Fehler beim Bilderimport behoben. Pro Bilderimport konnte immer nur 1 Bild pro Artikel importiert werden 4.1.6 Neue Bildstruktur ab 4.5.1 wird nun unterstützt ggf. vorhandene weitere Datenbankfelder in oxartextends können nun importiert werden (longdesc2 etc.) 4.1.5 Engl. Sprachkomponenten eingefügt Bugfix mit Langtexten und Varianten behoben 4.1.4 OXID 4.5: Probleme mit Einlesen von Datenfeldern aus oxarticles und oxartextends behoben OXID 4.5: Lupenfunktion auf der Artikeldetailseite funktioniert nun wieder 4.1.3 OXID 4.5.0: nötige Templateanpassungen (Smartyvariablen) durchgeführt OXID 4.5.0: getAbsDynImageDir() wurde von OXID entfernt OXID 4.5.0: Probleme mit Bilderweiterungen &quot;_pX&quot; z.B. &quot;bild_p1.jpg&quot; auf der Detailseite. Generierte Bilder erhalten darum nun keine Extension mehr z.B. &quot;bild.jpg&quot; trim() auf Einzelwerte der Kategorienamen Problem mit Mehrsprachigkeit behoben einfaches Profiling eingebaut 4.1.2 Fehler mit den Zoombildern gefixt Einbau des externen Bilderimports (Bild liegt in einer externen Url) 4.1.1 oxTags werden nun beim Import unterstützt &quot;list&quot;-Templates nuntzen nun die globalen JS-Funktionen wie editThis etc. Problem mit fehlendenden oxartextends Einträgen behoben (Artikel-oxId wurde mit NULL aus oxartextends überschrieben) Standard-Datenfelder (oxactive etc.) werden jetzt nur noch mit Standrad-Werten befüllt, wenn die Felder nicht explizit über Importspalten belegt werden &quot;sZoomImageSize&quot; wird nun als globale Zoombildgröße genutzt (seit OXID 4.3.0) &quot;oxpicsgenerated&quot; wird nun generell auf &quot;12&quot; gesetzt (seit OXID 4.3.0) Aktualisierung der language-Datei und der Tabelle &quot;oximporterdesc&quot; 4.1 kompletter UTF8 Support für Importdateien und Shop optionaler Texttrenner in der CSV, so dass auch HTML-Langtexte mit Zeilenumbrüchen korrekt importiert werden Korrektur der Zeilenanzahl bei CSV-Inhalten, die über mehrere Dateizeilen gehen (z.B. HTML-Daten) Wird die Importdatei z.B. per FTP aktualisiert, so erkennt das Modul nun automatisch im Reiter &quot;Stamm&quot; die geänderten Dateiwerte Lieferanten integriert Staffelpreise integriert Auswahllisten integriert Kurzinfo nach Import Löschmöglichkeit nach dem Import Übersetzung für oxarticles-Felder in lang.php hinzugefügt copy_this ab OXID 4.1.4 (nötige Templateänderungen) hinzugefügt Importe mit mehr als einer Kategoriespalte schlugen fehl diverse kleinere Bugfixes 4.0 Komplette Migration des Moduls auf OXID4.","tags":"","url":"changelog\/Changelog.html"},{"title":"Installation \/ Update \/ Deinstallation","text":"Anforderungen Neuinstallation Update Deinstallation Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unter Hilfe und Support genannten Kontaktdaten Bescheid.","tags":"","url":"installation\/Installation.html"},{"title":"Systemanforderungen","text":"PHP Version 5.6.x bis 8.0.x PHP Decoder installierter ionCube Loader Shopeditionen OXID eShop Community Edition (CE) OXID eShop Professional Edition (PE) OXID eShop Enterprise Edition (EE) OXID eShop B2B Edition Shopversionen OXID eShop in Compilation Version 6.0.x 6.1.x 6.2.x 6.3.x Themes Das Modul arbeitet unabhängig von den Frontend-Themes und bringt einen eigenen Bereich im Admin unter Module \/ Importer mit. D3 Modul-Connector (kostenfrei bei D3 erhältlich) ab Version 5.3.0.0 Installation via Composer mindestens ein freier Cronjob zur automatischen Ausführung der angelegten Aufgaben Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für Ihre genutzte PHP-Version sowie dem auf Ihrem Server vorhandenen Decoder (ionCube Loader) kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version. Kontrollieren Sie bitte auch, ob diese Modulversion für die von Ihnen eingesetzte Shopedition (Professional Edition (PE) oder Enterprise Edition (EE)) ausgelegt ist.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module \/ Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den Modul-Connector bitte vorab. Hinweise zu dessen Installation finden Sie in der Modul-Connector Dokumentation.","tags":"","url":"installation\/Anforderungen\/Vorbereitungen.html"},{"title":"Neuinstallation","text":"Schnellstart per Composer auf der Kommandozeile php composer require d3\/importer:^5.0.6.0 --update-no-dev .\/vendor\/bin\/oe-console oe:module:activate d3importer .\/vendor\/bin\/d3modules_install .\/vendor\/bin\/d3cleartmp Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Seiten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den Modul-Connector bitte vorab. Hinweise zu dessen Installation finden Sie in der Modul-Connector Dokumentation.","tags":"","url":"installation\/Neuinstallation\/Vorbereitung.html"},{"title":"Modul zur Installation hinzufügen","text":"auf der Kommandozeile Führen Sie in der Konsole im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) diesen Befehl aus, um das Modul Importer zur Installation hinzuzufügen: php composer require d3\/importer:^5.0.6.0 --update-no-dev Achten Sie darauf, dass Composer für die Installation die selbe PHP-Version verwendet, in der auch Ihr Shop ausgeführt wird. Sie erhalten sonst möglicherweise unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Treffen Sie bei der Installation auf spezielle Anforderungen, zu denen Sie Unterstützung benötigen, kontaktieren Sie uns bitte für weiteren Support.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Modul im Shop aktivieren","text":"im Adminbereich Aktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Importer auf den Button Aktivieren. oder auf der Kommandozeile Alternativ können Sie die Modulaktivierung auch auf der Kommandozeile (CLI) im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) durchführen. .\/vendor\/bin\/oe-console oe:module:activate d3importer Enterprise Edition: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen. Enterprise Edition: Zur Aktivierung in einem bestimmten Shopmandanten verwenden Sie das --shop-id-Argument (...oe-console --shop-id 1 oe:module...)","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"im Adminbereich Direkt nach der Modulaktivierung startet der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. oder auf der Kommandozeile Der Installationsassistent steht Ihnen ebenfalls auf der Kommandozeile (CLI) zur Verfügung. Führen Sie diesen Befehl im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) aus: .\/vendor\/bin\/d3modules_install","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"Datenbankanpassungen","text":"Sollten Sie Ihren Shop im Modus &quot;International&quot; (mit Standardsprache englisch) betreiben, so spielen Sie anschließend folgenden SQL-Befehl zusätzlich ein: UPDATE `d3importerdesc` SET `OXDESC` = (@TEMP1:=OXDESC), `OXDESC` = `OXDESC_1`, OXDESC_1 = @TEMP1;","tags":"","url":"installation\/Neuinstallation\/Datenbankanpassungen.html"},{"title":"TMP-Ordner leeren","text":"im Adminbereich Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. oder auf der Kommandozeile Alle TMP-leeren-Aktionen stehen Ihnen ebenfalls auf der Kommandozeile (CLI) zur Verfügung. Führen Sie diesen Befehl im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) aus: .\/vendor\/bin\/d3cleartmp Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus. Beim Kommandozeilenaufruf werden Ihnen weitere Optionen gezeigt, mit denen Sie die Aktion gezielt steuern können.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel eintragen","text":"im Adminbereich Das Modul verwendet Lizenzschlüssel, um die Lizenzverwaltung für Sie und auch für uns einfacher zu gestalten. Hierbei haben Sie je nach Modul die Wahl zwischen einer kostenfreien Testlizenz und einer Lizenz für den Einsatz im Livebetrieb. Klappen Sie den Eintrag des jeweiligen Moduls aus. Sofern erforderlich, können Sie hier den Lizenzassistenten starten, der schnell und einfach ihr Modul aktiviert. Hinweis: Bitte beachten Sie, dass der Aktivierungsident nur einmal verwendet werden kann. Wenn sich Ihr System als Testshop unter einer vorübergehenden Domain (URL) befindet, empfehlen wir das Modul vorerst als Testversion laufen zu lassen. Im Testmodus gibt es bei diesem Modul Einschränkungen: Artikelimport: es können max. 4 Profile angelegt werden es werden max. 10 Zeilen importiert Bilderimport: es werden max. 5 Bilder (bzw. externe Bilder) importiert","tags":"","url":"installation\/Neuinstallation\/Lizenz_eintragen.html"},{"title":"Admin neu starten","text":"Im linken Menü finden Sie einen neuen Eintrag: Module \/ Importer. Sollte dieser Menüpunkt bei Ihnen noch nicht vorhanden sein, melden Sie sich vom Shop-Admin bitte kurz ab und anschließend wieder an.","tags":"","url":"installation\/Neuinstallation\/Admin_neu_starten.html"},{"title":"Updatefähigkeit","text":"Bei individuellen Änderungen von Moduldateien empfehlen wir, jeweils die Überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht zu verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefaehigkeit.html"},{"title":"Wann kann ein Update ausgeführt werden?","text":"Die Updateanweisungen können verwendet werden, wenn dieses Modul schon früher mit Hilfe von Composer installiert wurde. Wurde die Installation bisher noch nicht durchgeführt oder die Installation wurde nicht über Composer durchgeführt (weil das Modul dies z.B. früher nicht unterstützte), verwenden Sie bitte die Beschreibung unter Neuinstallation.","tags":"","url":"installation\/Update\/Updatedefinition.html"},{"title":"Modul deaktivieren","text":"im Adminbereich Deaktivieren Sie das Modul unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Importer auf den Button Deaktivieren. oder auf der Kommandozeile Alternativ können Sie die Moduldeaktivierung auch über die Kommandozeile (CLI) im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) durchführen. .\/vendor\/bin\/oe-console oe:module:deactivate d3importer Enterprise Edition: Achten Sie darauf, dass das Modul in allen weiteren Shops (Mall) ebenfalls deaktiviert werden muss. Enterprise Edition: Zur Deaktivierung in einem bestimmten Shopmandanten verwenden Sie das --shop-id-Argument (...oe-console --shop-id 1 oe:module...)","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Dateien erneuern","text":"auf der Kommandozeile Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie dort diesen Befehl aus: php composer require d3\/importer:^5.0.6.0 --update-no-dev Im weiteren Ablauf werden Sie gefragt, ob die Moduldateien überschrieben werden sollen. Bestätigen Sie dies für den Eintrag d3\/importer. Achten Sie darauf, dass Composer für die Installation die selbe PHP-Version verwendet, in der auch Ihr Shop ausgeführt wird. Sie erhalten sonst möglicherweise unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Treffen Sie bei der Installation auf spezielle Anforderungen, zu denen Sie Unterstützung benötigen, kontaktieren Sie uns bitte für weiteren Support.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"im Adminbereich Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Importer auf den Button Aktivieren. oder auf der Kommandozeile Alternativ können Sie die Modulaktivierung auch über die Kommandozeile (CLI) im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) durchführen. .\/vendor\/bin\/oe-console oe:module:activate d3importer Enterprise Edition: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen. Enterprise Edition: Zur Aktivierung in einem bestimmten Shopmandanten verwenden Sie das --shop-id-Argument (...oe-console --shop-id 1 oe:module...)","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installieren","text":"im Adminbereich Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen. oder auf der Kommandozeile Der Installationsassistent steht Ihnen ebenfalls auf der Kommandozeile (CLI) zur Verfügung. Führen Sie diesen Befehl im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) aus: .\/vendor\/bin\/d3modules_install","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"im Adminbereich Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. oder auf der Kommandozeile Alle TMP-leeren-Aktionen stehen Ihnen ebenfalls auf der Kommandozeile (CLI) zur Verfügung. Führen Sie diesen Befehl im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) aus: .\/vendor\/bin\/d3cleartmp Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus. Beim Kommandozeilenaufruf werden Ihnen weitere Optionen gezeigt, mit denen Sie die Aktion gezielt steuern können.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel aktualisieren","text":"im Adminbereich Wird für die neue Modulversion ein aktualisierter Lizenzschlüssel benötigt, tragen Sie diesen im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung ein. Klappen Sie dazu den Eintrag des jeweiligen Moduls aus und starten den Lizenzassistent.","tags":"","url":"installation\/Update\/Lizenzschluessel_aktualisieren.html"},{"title":"Erweiterungen anpassen","text":"Haben Sie für dieses Modul eigene Erweiterung entwickelt, gleichen Sie dies bitte mit der neuen Fassung des Moduls ab.","tags":"","url":"installation\/Update\/Erweiterungen_anpassen.html"},{"title":"Installationsprüfung","text":"Um die erfolgreiche Installation zu prüfen, können Sie die folgende Checkliste verwenden: Einstellungsunabhängige Prüfungen Backend Modul ist unter Erweiterungen \/ Module aktiv geschaltet Modul ist unter Module \/ Modul-Connector \/ Modulverwaltung aktiv geschaltet Modul zeigt unter Module \/ Importer einen eigenen Bereich für Einstellungen","tags":"","url":"installation\/Installationspruefung.html"},{"title":"Schnellstart","text":"Das Modul Importer bringt einen umfangreichen Adminbereich mit, in dem Sie die Konfigurationseinstellungen des Moduls setzen können. Über das Menü Module \/ Importer sehen Sie folgende Menüpunkte: Einstellungen - Definieren Sie die Grundeinstellungen für die ImportProfile Artikelimport - Übersicht für die Importprofile + Einstellungen für den Artikelimport eines jeweiligen Importprofils Bildimport - Übersicht für die Importprofile + Einstellungen für den Bildimport pro Importprofil Artikelfelder - Übersicht der aktuell konfigurierbaren Artikelfeldzuordnungen Arbeiten Sie idealerweise die Optionen einmal durch. Hinweise zu den einzelnen Einstellungen finden Sie in dem dahinter, stehenden Fragezeichenfeld ? . Durch einen Klick darauf öffnet sich der Hinweistext. Die meisten Optionen sind zusätzlich im Handbuch zum Modul umfangreicher beschrieben.","tags":"","url":"installation\/Schnellstart.html"},{"title":"Demodaten","text":"Wir stellen für das Modul Demodaten bereit, mit denen Sie einfache Tests ausführen können. Weiterhin können Ihnen diese als Vorlage für eigene Importdateien dienen. Führen Sie in der Konsole im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) diesen Befehl aus, um die Demodaten zur Installation hinzuzufügen: php composer require d3\/importer-demodata --update-no-dev Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer. Nach der Installation der Demodaten lassen Sie bitte die Shopanpassungen nachtragen. Verwenden Sie dazu bitte diesen Ablauf.","tags":"","url":"installation\/Demodaten.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul Importer aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"im Adminbereich Deaktivieren Sie das Modul unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Importer auf den Button Deaktivieren. oder auf der Kommandozeile Alternativ können Sie die Moduldeaktivierung auch über die Kommandozeile (CLI) im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) durchführen. .\/vendor\/bin\/oe-console oe:module:deactivate d3importer Enterprise Edition: Achten Sie darauf, dass das Modul in allen weiteren Shops (Mall) ebenfalls deaktiviert werden muss. Enterprise Edition: Zur Deaktivierung in einem bestimmten Shopmandanten verwenden Sie das --shop-id-Argument (...oe-console --shop-id 1 oe:module...)","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"auf der Kommandozeile Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/importer --no-update Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner d3\/importer und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"TMP-Ordner leeren","text":"im Adminbereich Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. oder auf der Kommandozeile Alle TMP-leeren-Aktionen stehen Ihnen ebenfalls auf der Kommandozeile (CLI) zur Verfügung. Führen Sie diesen Befehl im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) aus: .\/vendor\/bin\/d3cleartmp Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus. Beim Kommandozeilenaufruf werden Ihnen weitere Optionen gezeigt, mit denen Sie die Aktion gezielt steuern können.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Demodaten","text":"Wir stellen für das Modul Demodaten bereit, mit denen Sie einfache Tests ausführen können. Weiterhin können Ihnen diese als Vorlage für eigene Importdateien dienen. Führen Sie in der Konsole im Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses) diesen Befehl aus, um die Demodaten zur Installation hinzuzufügen: php composer require d3\/importer-demodata --update-no-dev Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer. Nach der Installation der Demodaten lassen Sie bitte die Shopanpassungen nachtragen. Verwenden Sie dazu bitte diesen Ablauf.","tags":"","url":"manual\/Bedienungsanleitung\/Demodaten.html"},{"title":"Beschreibung Funktionsumfang","text":"Beschreibung \/ Funktionsumfang Modul für den individuellen und wiederkehrenden Import großer Artikelmengen aus einer Excel Datei (CSV-Format) Importiert werden können: alle Artikelstammdaten Artikellangtexte (auch HTML) Artikelbilder Kategorien Crossselling (Zubehör \/ Ähnliche Artikel) Attribute Auswahllisten Varianten Staffelpreise Hersteller \/ Lieferanten Wichtige Features: Wählen Sie einen von 3 Importtypen aus: Bei &quot;Import und Update&quot; werden Artikel importiert und aktualisiert (Standard Auswahl). Bei &quot;nur Import&quot; werden Artikel nur importiert. Es werden keine vorhandenen Artikeldaten überschrieben. Bei &quot;nur Update&quot; werden Artikel nur aktualisiert. Es werden keine neuen Artikel angelegt. Speicherung der verwendeten Import-Profil-ID an importierten\/aktualisierten Artikeln z.B. für Nachimport-Aktionen automatische Importe (z.B. Nachts) für beliebige, gespeicherte Importprofile Speicherung beliebig vieler Importprofile Exportfunktion für Importprofile unter Importer \/ Einstellungen \/ Stamm Variable Strukturen in der Importdatei möglich. Die Zuordnungen &quot;CSV zu Shop&quot; können über das Importprofil eingestellt werden. definierbare Standardwerte für die Einstellungen der Import-Profile Alle Artikel die nicht aktualisiert wurden, können Sie nachträglich über den Admin im Nach Import löschen oder deaktivieren.","tags":"","url":"manual\/Bedienungsanleitung\/Beschreibung_Funktionsumfang.html"},{"title":"Technische Vorraussetzungen","text":"Sie benötigen einen sFTP\/FTPs-Zugang, Zugriff auf den Shop-Admin und den Shop (Backend\/Frontend) zur Kontrolle des Importes. Sofern Sie die CSV-Datei manuell editieren möchten, empfehlen wir den Einsatz eines Tabellenkalkulationsprogramm's. Damit können Sie Ihre Importdatei öffnen (beispielsweise Microsoft Excel oder LibreOffice Calc\/OpenOfficeCalc).","tags":"","url":"manual\/Bedienungsanleitung\/Technische_Vorraussetzungen.html"},{"title":"Teil 1 Artikelimport","text":"Öffnen Sie im Admin Module \/ Importer \/ Artikelimport Wählen Sie im Stamm einen Profilnamen Wählen Sie eine vorhandene Datei aus oder wählen Sie eine neue Datei für den Upload. Geben Sie die Datei-Spaltentrennung und ggf. den Texttrenner an. Ordnen Sie unter Artikelfelder alle in Ihrer Liste vorkommenden Spalten den richtigen Datenfeldern zu. Setzen Sie bei Update einen\/mehrere Haken, wenn die Informationen am Artikel aktualisiert werden sollen. wichtiger Hinweis: Für den Bilderimport verwenden Sie die Feldnamen &quot;Bild Importfeld 1-10(d3importpic1-10)&quot; anstatt &quot;Bild 1-10(oxpic1-10)&quot;. Ordnen Sie die Kategorien zu. Sie können beliebig viele Zuordnungen erstellen Ordnen Sie unter Crossselling die entsprechenden Datenfelder für Crossselling und Zubehör zu. Unter Attribute können Sie mehrsprachig, den Attributsnamen und den Attributswert am Artikel importieren. Sie können beliebig viele Attribute festlegen. Nehmen Sie die Konfiguration für die Auswahllisten vor. Sie können beliebig viele Auswahllisten festlegen. Geben Sie bei Varianten die Spalten für Variantenname, Variante von und Variantenbezeichnung an. Geben Sie bei Staffelpreisen die Felder Staffelpreis, Menge von und Menge bis an. Sie können beliebig viele Staffelpreise festlegen. Wählen Sie bei Hersteller die Datenfelder für Hersteller und Lieferanten Unter Konfig. wählen Sie: Wie viele Dateizeilen pro Durchlauf importiert werden sollen, den Importtyp, die Anzahl Datei-Kopfzeilen und die Artikelidentifikation. Zusätzlich können Sie die Preis Optionen und Artikel-Ident Optionen (Expertenmodus) einstellen Klicken Sie im Reiter Import auf Artikelimport starten Unter Nach Import werden Informationen zu den -zuletzt mit diesem Profil importierten- Artikeln angezeigt. Alle Artikel deaktivieren - deaktiviert alle Artikel 1. Alle Artikel löschen - löscht alle Artikel 1. 1. Betrifft Artikel, welche mit dem letztem Import dieses Profils nicht aktualisiert wurden. Wurde ein Artikel bereits mit einem anderen Profil bearbeitet, wird dieser nicht beeinflusst.","tags":"","url":"manual\/Bedienungsanleitung\/Schnelleinstieg\/Teil1_Artikelimport.html"},{"title":"Teil 2 Vorbereitung Bilderimport","text":"Öffnen Sie vom root-Verzeichnis \/source\/ ausgehend, den Unterordner \/import\/pictures\/. In das Verzeichnis laden Sie alle Artikelbilder, die vom Namen her identisch mit den Bildnamen in Ihrer Liste sind (z.B. \/import\/pictures\/beispielbild.jpg). Externe Bilder werden automatisch über den Bildimport in das Verzeichnis \/source\/import\/pictures\/ heruntergeladen.","tags":"","url":"manual\/Bedienungsanleitung\/Schnelleinstieg\/Teil2_Vorbereitung_Bilderimport.html"},{"title":"Teil 3 Bilderimport","text":"Gehen Sie in den Admin unter Module \/ Importer \/ Bilderimport. Wählen Sie in der Auswahl Bild Importfeld 1 für das 1. Artikelbild und ordnen Sie die jeweiligen Zielfelder zu (bzw. Vorschaubild, Detailbild 1-10, Icon). Gehen Sie für weitere Bildimportfelder gleich vor, setzen Sie noch gewünschte Einstellungen und klicken Sie anschließend auf Speichern. Gehen Sie auf den Reiter Import und wählen Sie optional die Einstellung Externe Bilder einlesen. Mit Bildimportverzeichnis einlesen werden alle Bilder aus dem Verzeichnis \/import\/pictures\/ ausgelesen. (bei aktivierter Einstellung externe Bilder einlesen werden die Bilder vorher in das Bildimportverzeichnis geladen) Danach klicken Sie auf Bilderimport starten. Nachdem Bilderimport wird Ihnen angezeigt, wie viele Bilder bearbeitet und importiert wurden.","tags":"","url":"manual\/Bedienungsanleitung\/Schnelleinstieg\/Teil3_Bilderimport.html"},{"title":"Einleitung","text":"In den folgenden Kapitel wird der komplette Ablauf eines Artikel- und des Bilderimports ausführlich beschrieben. Es wird erklärt, wie Sie Importprofile anlegen können, die gewünschte Importdatei in den Shop laden und alle Vorbereitungen für den Bild-\/Import treffen. Der Import gliedert sich in folgende Schritte: Anlegen einer eigenen Importdatei Artikelimport Bilderimport wichtiger Hinweis: Der Artikelimport muss immer vor einem Bilderimport durchgeführt werden. Siehe Artikelimport \/ Artikelfelder \/ Bildnamen Optional bieten die Menüpunkte Artikelfelder und Grundeinstellungen fortgeschrittene Konfigurationsmöglichkeiten.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Einleitung.html"},{"title":"Anlegen einer eigenen Importdatei","text":"Speichern Sie Ihre Importdatei vorzugsweise mit dem Datei-Spaltentrenner ; (Semikolon). Die interne Spaltentrennung (Beispielsweise bei Varianten oder Staffelpreisen) sollten mit Komma oder | (Pipe) getrennt sein. Schauen Sie sich Ihre Importdatei am besten mit einem Tabellenkalkulationsprogramm (Excel, LibreOffice, etc.) an und setzen Sie optional Spaltenüberschriften. Für Ihren Import benötigen Sie nur die Spalten, die Sie auch tatsächlich für Ihren Artikel brauchen. Möchten Sie eine Liste selbst anlegen, können Sie sich an diesem Beispiel orientieren: Beispiel .csv-Datei Artikelnummer;Titel;Langbeschreibung;Suchbegriffe;Preis;Kategorie;Varianten Name;Hersteller 1402;Trapez ION MADTRIXX;Langtext;harness, hip harness, madtrixx;45,00 €;1208|1302|1303|1304|1401;6454;Beispielhersteller Die Artikelnummer bzw. die Identifikation (EAN, MPN) muss immer eindeutig sein und im Admin als Artikelidentifikation hinterlegt werden. Ein vollständiges Beispiel einer CSV finden Sie im Modulpaket unter \/setup+doku\/examples\/demo_artikel_klomplett.xls. Diese können Sie in das Importdatei-Format umwandeln, indem Sie unter Datei \/ speichern unter klicken und dann als Dateityp &quot;Text Importdatei (.csv )&quot; auswählen. Weitere Informationen finden Sie unter Häufig gestellte Fragen","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Anlegen_einer_eigenen_Importdatei.html"},{"title":"Artikelfelder","text":"Im Admin unter Module \/ Importer \/ Artikelfelder können Sie einzelne Felder aus der Tabelle oxarticles definieren. Die Einstellungen eines jeden Felds wird beim Import und in der Adminoberfläche des Importers genutzt. So können individuelle Feldnamen (bspw. oxarticles__d3newfield) mit einem aussagekräftigen Namen ausgestattet werden. Folgende Einstellungen kann man pro Feld definieren: [Aktiv] De\/Aktivieren Sie das Artikelfeld für die Adminoberfläche des Importers [Bild] De\/Aktivieren Sie das Artikelfeld für die Adminoberfläche des Bildimports (neue Felder werden im Admin nicht angezeigt) Diese Einstellung wird derzeit nicht effektiv genutzt. [Datenbankfeldname] Tragen Sie hier den Namen des Datenbankfelds von oxarticles oder oxartextends ein. [Artikelfeld Sprache 1] + [Artikelfeld Sprache 2] Geben Sie dem Artikelfeld einen lesbaren Namen in der entsprechenden Sprache an. [Sortierung] Hier können Sie die Sortierreihenfolge für den Admin festlegen. Oft benutzte Artikelfelder können mit einer niedrigen Zahl weiter oben angezeigt werden. Das Modul verwendet die aktiven Artikelfelder in den Admin-Bereichen unter \/ Module\/Importer\/: Artikelimport\/Artikelfelder Die Dropdown Felder unter [Spalteninhalt und Zuordnung] zeigen den [Datenbankfeldname] sowie dessen gepflegte Übersetzung [Artikelfeld Sprache n] an. Artikelimport\/Varianten Die Artikelfelder beginnend mit oxvarname (Name der Auswahl) und oxvarselect (Auswahl) werden hier als einstellbare CSV-Zuordnung bereitgestellt. Einstellungen\/Grundeinstellungen\/Auswahl für Artikelidentifikationsfelder Der [Datenbankfeldname] wird in der Mehrfach-Auswahlliste angezeigt.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelfelder.html"},{"title":"Grundeinstellungen","text":"Im Admin unter Module \/ Importer \/ Einstellungen befinden sich die Grundeinstellungen. Die verschiedenen Optionen sind konfigurierbare Voreinstellungen für Importe und Importprofile. Jede Option auf der Seite wird als Voreinstellung bei der Anlage der Importprofile genutzt. Voreinstellung Wo wird diese genutzt? (Admin: \/ Module\/Importer\/) Auswahl für Artikelidentifikationsfelder Artikelimport \/ Konfig. \/ Artikelidentifikation (1.) Definition von &quot;ja&quot; Werten Artikelimport \/ Konfig. \/ Definition von &quot;ja&quot; Werten Definition von &quot;nein&quot; Werten Artikelimport \/ Konfig. \/ Definition von &quot;nein&quot; Werten vordefinierte Werte für Artikelfelder Artikelimport \/ Konfig. \/ vordefinierte Werte für Artikelfelder Dateizeilen pro Durchlauf Artikelimport \/ Konfig. \/ Dateizeilen pro Durchlauf Anzahl Datei-Kopfzeilen Artikelimport \/ Konfig. \/ Anzahl Datei-Kopfzeilen Auswahl für Kategorieidentifikationsfelder Artikelimport \/ Kategorien \/ Kategoriefeld Zuordung Start des nächsten Bilddurchlaufes Bilderimport \/ Stamm \/ Start des nächsten Bilddurchlaufes lokale Bilder (\/import\/pictures\/) durch Externe überschreiben? Bilderimport \/ Stamm \/ lokale Bilder (\/import\/pictures\/) durch Externe überschreiben? Masterbilder am Artikel vorher entfernen (empfohlen) Bilderimport \/ Stamm \/ Masterbilder am Artikel vorher entfernen (empfohlen) (1.) Die Sichtbarkeit der Felder im Importer Admin, kann unter Module \/ Importer \/ Artikelfelder editiert werden.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Grundeinstellungen.html"},{"title":"Anlegen von Importprofilen","text":"Wofür werden Importprofile benötigt? Bei der täglichen Arbeit mit Artikelimporten kommt es häufig vor, dass Sie aus verschiedenen Quellen (bspw. Lieferanten) CSV-Daten erhalten. Meist ist der Aufbau der Quelldaten sehr unterschiedlich. Das Modul ermöglicht diese einfach in den Shop zu integrieren. Der Kernpunkt eines jeden Imports ist das Importprofil. Sie können für jede unterschiedliche Datenquelle schnell und übersichtlich ein Importprofil konfigurieren. Danach kann der Importvorgang entweder über den Shop-Admin oder per Cronjob gestartet werden. Für die Erstellung eines neuen Importprofils öffnen Sie Ihren Shop-Admin und navigieren Sie zu: Module \/ Importer \/ Artikelimport Sie können direkt die Felder ausfüllen und das Importprofil mit Speichern anlegen. Alternativ können Sie am unteren Fensterrand folgenden Link finden: Neues Importprofil anlegen","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/anlegen_von_Importprofilen.html"},{"title":"Stamm","text":"Stammdaten Hinweise Profilname Geben Sie hier Ihrer Importliste einen Namen (z.B. Hersteller XYZ Import ). Importdatei Zeigt die aktuelle Dateizuordnung und zeigt eine Dateiliste des Verzeichnisses \/source\/import\/ Neue Datei hochladen Klicken Sie auf [Durchsuchen] und wählen Sie eine CSV-Datei aus. (Mit [Speichern] wird die Datei auf den Server geladen.) Datei-Spaltentrennung Geben Sie an, welches Trennzeichen Ihre Importdatei für die einzelnen Spalten verwendet. (bspw.: ; oder | oder TAB) Texttrenner (optional) Der Texttrenner umschließt in einer CSV-Datei einzelne Zellen. (bspw.: &quot; oder ') Klicken Sie dann auf Speichern. Datei-Info: In diesem Block finden Sie alle wichtigen Informationen zu der aktuell ausgewählten Importdatei: Name Dateigröße letzte Änderung Datei-Rechte (ist die Datei lesbar\/beschreibbar) CSV-Daten: bspw. Zeilen\/Spalten Anzahl","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Stamm.html"},{"title":"Artikelfelder","text":"Hier können Sie die Spalten Ihrer Importdatei den jeweiligen Artikel-Datenbankfeldern zuordnen. Hinweis: Lassen Sie Felder an dieser Stelle frei, für die es einen eigenen Reiter\/Tab gibt. bspw: Kategorie, Cross-Selling, Attribute, Auswahllisten, Varianten, Staffelpreise, Hersteller, Mall Für jede CSV-Spalte wird ein Dropdown Feld angezeigt. Aus der aktuell ausgewählten Zeile wird der Inhalt der CSV-Zelle über dem Dropdown-Feld angezeigt. Sie können durch die einzelnen Zeilen in Ihrer CSV-Datei navigieren. Wechseln Sie von der Zeile 1 (bspw. Spaltenüberschrift) auf die Zeile 2 (nächste Artikeldaten). Wählen Sie aus dem Drop-Down Feld die richtige Zuordnung aus. Hier ein paar Beispiele: Titel (oxtitle) Langbeschreibung (oxlongdesc) Suchbegriffe (oxsearchkeys) Preis (oxprice) Bild 1-10 (oxpic1-10): wichtiger Hinweis: Bitte wählen Sie statt oxpic1-10 für den Bilderimport die moduleigenen Felder: Bild Importfeld 1 (d3importpic1) Bild Importfeld 2 (d3importpic2) ... Bild Importfeld 10 (d3importpic10) Pflicht ist die Zuordnung der Artikelidentifikation! wichtiger Hinweis: Das Feld für die Artikelidentifikation muss hier für jedes Importprofil zugeordnet werden. Der Wert muss einzigartig sein, damit keine Artikelduplikate entstehen. Bspw.: Artikelnummer, Hersteller EAN, EAN, etc. Die Checkboxen hinter den Dropdown-Feldern regulieren, ob der Inhalt nur importiert oder geschrieben wird. Checkbox aktiv: Ist ein Artikel bereits in der Datenbank vorhanden, wird der Inhalt aktualisiert. Checkbox inaktiv: Der Inhalt wird nur geschrieben, wenn der Artikel noch nicht existiert. Die Einstellung zur Art des Importprofils (Import &amp; Update, nur Import, nur Update) finden Sie im Tab Konfig.. Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Artikelfelder.html"},{"title":"Kategorien","text":"Sie können einen Artikel beliebig vielen Kategorien zuordnen. Wählen Sie den Importtyp aus. Nur Import Die Kategorien werden normal importiert bzw. dem Artikel zugeordnet Artikel-Kat.-Zuordnungen vorher löschen Alle Kategorie-Zuordnungen des aktuellen Artikels werden vor dem Import gelöscht. Kategoriefeld Zuordnung Wählen Sie die gewünschte Identifikation der Zuordnung aus. Folgende Werte stehen standardmäßig zur Auswahl: oxtitle exakter Name der Kategorie \/ Kategoriebaum oxid shopinterne Identifikation der Kategoie oxsort Sortierungsnummer der Kategorie oxdesc Kurzbeschreibung der Kategorie Spaltenzuordnung n Wählen Sie in dem Dropdown-Feld die CSV-Spalte aus, welche den Inhalt der Kategoriefeld Zuordnung hat. interne Spaltentrennung Wenn Sie beispielsweise Hauptkategorie|Unterkategorie|Unterunterkategorie angegeben haben, tragen Sie das Zeichen | ein. Beim Import wird registriert, ob die Kategorie Struktur in dieser Form besteht. Wenn nicht, wird diese mit der Information der Spaltenzuordnung n angelegt. Bitte achten Sie auf die korrekte Schreibweise, Groß- und Kleinschreibung! Sie können einen Artikel beliebig vielen Kategorien zuordnen. Neue Möglichkeiten der Spaltenzuordnung n werden nach dem Speichern automatisch erweitert. Klicken Sie abschließend auf Speichern. Weitere Informationen finden Sie unter Häufig gestellte Fragen","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Kategorien.html"},{"title":"Cross-Selling und Zubehör","text":"Cross-Selling Wählen Sie den Cross-Selling Importtyp aus. Nur Import Das Cross-Selling wird normal dem Artikel zugeordnet [Artikel-Cross-Sell.-Zuordnungen vorher löschen Alle Zuordnungen des aktuellen Artikels werden vor dem Import gelöscht. Spaltenzuordnung n Wählen Sie in dem Dropdown-Feld die entsprechende CSV-Spalte aus. interne Spaltentrennung Wenn Sie beispielsweise 7353|80085|0815 angegeben haben, tragen Sie das Zeichen | ein. Zubehör Wählen Sie den Zubehör Importtyp aus. Nur Import Das Zubehör wird normal dem Artikel zugeordnet [Artikel-Zubehör-Zuordnungen vorher löschen Alle Zuordnungen des aktuellen Artikels werden vor dem Import gelöscht. Spaltenzuordnung n Wählen Sie in dem Dropdown-Feld die entsprechende CSV-Spalte aus. interne Spaltentrennung Wenn Sie beispielsweise 1402|1503|0815 angegeben haben, tragen Sie das Zeichen | ein. Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Cross-Selling_+_Zubehoer.html"},{"title":"Attribute","text":"Wählen Sie den Attribute Importtyp aus: Nur Import Die Attribute werden normal dem Artikel zugeordnet. Artikel-Attribut-Zuordnungen vorher löschen Alle Attribut-Zuordnungen des aktuellen Artikels werden vor einem Update gelöscht. In Version 4.4.1.0 gab es eine Umstellung der Attributszuordnungen. Weitere Informationen finden Sie in unserer FAQ: Anleitung zur Umstellung von Attributszuordnungen. n. Attributszuordnung Sie können mehrere Attribute importieren. Jede Attributszuordnung wird als Attribut angesehen. D.h. für 1 Attribut kann nur eine Attributszuordnung verwendet werden. pro Sprache können Sie Name und Wert definieren: Attributsname Wählen Sie die CSV-Spalte mit dem Namen des Attributs aus. Bspw. &quot;Material&quot;, &quot;Höhe&quot; oder &quot;Farbe&quot; (ohne Anführungszeichen). Attributswert am Artikel Wählen Sie hier die zugehörige CSV-Spalte mit dem Wert des Attributs am Artikel aus. Bspw. &quot;Aluminium&quot;, &quot;30cm&quot; oder &quot;matt&quot; (ohne Anführungszeichen). Neue Möglichkeiten der n. Attributszuordnung werden nach dem Speichern automatisch erweitert. Klicken Sie auf Speichern um die Attributszuordnung zu sichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Attribute.html"},{"title":"Auswahllisten","text":"Auswahllisten-Importtyp Nur Import Eine neue Auswahlliste wird erstellt und dem Artikel zugeordnet. Alle Auswahllisten vorher löschen Alle Auswahllisten, die ausschließlich dem aktuellen Artikel zugeordnet sind, werden vor dem Update gelöscht. Titel der Auswahlliste n Geben Sie hier die CSV-Spalte an, worin der Titel z.B. &quot;Farbe&quot; hinterlegt ist. Alternativtitel Ist kein &quot;Titel der Auswahlliste&quot; vorhanden oder ist der Inhalt teilweise leer, so kann hier ein Alternativtitel z.B. &quot;Auswahl&quot; angegeben werden. Auswahlfelder n Wählen Sie die CSV-Spalte aus, welche die Auswahlen (Werttrenner-separiert) z.B. &quot;rot|grün|blau&quot; enthält. Werttrenner Stehen mehrere Werte im CSV-Importfeld &quot;Auswahlfelder&quot;, so muss der verwendete Werttrenner angegeben werden. Z.B. &quot;@&quot; wenn in der CSV &quot;rot@gelb@grün&quot; steht. Preistrenner Zusätzlich können Preisänderungen (absolute Werte und in %) importiert werden. z.B. &quot;rot|2,34@gelb|5%@grün|1,23&quot;. In dem Beispiel müsste als Werttrenner &quot;@&quot; und als Preistrenner &quot;|&quot; eingetragen werden. Es sind beliebig viele Auswahllisten mit entsprechenden Werten pro Artikel importierbar. Hinweise: Auswahllisten werden immer neu angelegt. Eine Zuordnung wird nicht unterstützt, da eine Auswahlliste nicht eindeutig sein muss. Fallbeispiel: Zwei Artikel haben jeweils eine Auswahlliste mit Namen Farbe: T-Shirt A: Name der Auswahlliste: Farbe Werte: rot, blau T-Shirt B: Auswahlliste: Farbe Werte: gelb, grün Die Auswahlliste hat keine eindeutige Identifizierungsmöglichkeit. Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Auswahllisten.html"},{"title":"Varianten","text":"Varianten Importtyp Nur Import Die Varianten werden dem Eltern-Artikel neu zugeordnet oder aktualisiert Varianten vorher löschen Alle Varianten-Artikel des aktuellen Eltern-Artikels werden vor dem Update gelöscht. Variantenerkennung Geben Sie hier die CSV-Spalte mit der Artikelidentifikation (z.B. Artikelnummer, EAN, etc.) an. Der Eltern-Artikel wird daran identifiziert und dient der Zuordnung der Variante. Name der Auswahl Diese sollte nur am Eltern-Artikel hinterlegt werden und definiert, wie die Auswahl zwischen den verschiedenen Varianten heißen soll. Z.B.: &quot;Größe&quot;, &quot;Farbe&quot;, &quot;Material&quot; Sprache 2: Name Wählen Sie optional die CSV-Spalte für die 2te Sprache (Sprach-ID 1, Name der Auswahl hat die Sprach-ID 0) aus. Z.B.: &quot;size&quot;, &quot;color&quot;, &quot;material&quot; Varianten: Auswahl Hier wählen Sie die CSV-Spalte mit den Inhalten für die Variante aus. Z.B.: &quot;rot&quot;, &quot;grün&quot;, &quot;blau&quot; Varianten Sprache 2: Auswahl Wählen Sie optional die CSV-Spalte für die 2te Sprache (Sprach-ID 1, Varianten: Auswahl hat die Sprach-ID 0) aus. Z.B.: &quot;red&quot;, &quot;green&quot;, &quot;blue&quot; Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Varianten.html"},{"title":"Staffelpreise","text":"Importtyp Nur Import Die Staffelpreise werden dem Artikel neu zugeordnet oder aktualisiert. Staffelpreise vorher löschen Alle Staffelpreise des Artikels werden vor dem Update gelöscht. Jede Preisstaffel benötigt mind. 3 Datenfelder: Staffelpreis n CSV-Spalte mit dem jeweiligen Staffelpreis wählen Menge von CSV-Spalte mit dem &quot;ab Preis&quot; wählen Menge bis CSV-Spalte mit dem &quot;bis Preis&quot; wählen ist % Rabatt Preis? Hier definieren Sie (optional), ob die Preisstaffel als prozentual importiert wird. Alternativ können Sie in der CSV-Datei den Wert in der Spalte Staffelpreis n mit % versehen (bspw. 5% oder 10%). Klicken Sie abschließend auf Speichern. Weitere Informationen finden Sie unter Häufig gestellte Fragen","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Staffelpreise.html"},{"title":"Hersteller \/ Lieferanten","text":"Lieferanten Importspalte \/ Hersteller Importspalte Ordnet die Dateispalte mit dem Lieferanten- bzw. Herstellernamen zu. Ja Existiert der Lieferant\/Hersteller nicht im Shop, wird er neu angelegt und dem Artikel zugeordnet. Nein, nur Zuordnung Der Artikel wird nur einem vorhandenen Lieferant\/Hersteller zugeordnet. Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Hersteller_Lieferanten.html"},{"title":"Grundeinstellungen","text":"Importtyp Import und Update Alle CSV-Daten werden erst aktualisiert und anschließend -wenn nicht vorhanden- importiert. Nur Import Alle CSV-Daten werden nur importiert. Vorhandene Artikeldaten werden nicht überschrieben. Nur Update Alle CSV-Daten werden nur geschrieben, wenn bereits ein Artikel in der Datenbank gefunden wurde. Dateizeilen pro Durchlauf Legen Sie fest, wie viele Zeilen pro Importdurchlauf geladen werden sollen. Wenn Sie z.B. 100 eintragen, werden die ersten 100 Zeilen importiert. Danach wird die untere Seite neu geladen und die nächsten 100 Zeilen werden importiert, solange bis die komplette CSV-Datei eingelesen ist. Damit wird sichergestellt, dass der Importvorgang nicht abbricht (durch bspw. eingestellte Server Limitierungen). Anzahl Datei-Kopfzeilen (werden nicht importiert) Wenn Sie eine Spaltenüberschrift in Ihrer Import-Datei haben, können Sie die Anzahl der zu überspringenden Zeilen eintragen. Artikelidentifikation Legen Sie die eindeutige Artikelidentifikation fest. Das gewählte Feld muss zwingend unter Artikelfelder, einer Importspalte zugeordnet werden. Definition von &quot;ja&quot; und &quot;nein&quot; Werten In einer CSV-Datei können verschiedene Werte für einen &quot;Aktiv&quot;-Haken stehen. bspw.: Ja\/Nein, true\/false, 1\/0, j\/n, aktiv\/inaktiv. Geben Sie die einzelnen Werte zeilenweise getrennt ein, damit beim Importvorgang die Werte für den Shop übersetzt werden können. Weitere Informationen finden Sie unter Häufig gestellte Fragen","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Konfiguration\/Grundeinstellungen.html"},{"title":"Preis Optionen","text":"Importierten Artikelpreis um x % erhöhen. Hier können Sie den importierten Artikelpreis prozentual erhöhen. Importierten Artikelpreis auf x Nachkommastellen runden. Geben Sie hier einen Wert ein, um den Artikelpreis zu runden. Beispiel: &quot;2&quot; bedeutet, dass von 12.3456 auf 12.35 oder von 1.95583 auf 1.96 gerundet wird. bei &quot;1&quot; wird von 12.3456 auf 12.3 oder von 1.95583 auf 2 gerundet. Hinweis: Beide Optionen greifen lediglich bei dem normalen Artikelpreis (oxprice)!","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Konfiguration\/Preis_Optionen.html"},{"title":"Artikel-Ident Optionen (Expertenmodus)","text":"Artikelidentifikationsfeld als Ident (Datenfeld &quot;oxid&quot;) nutzen Mit dieser Einstellung wird die verwendete Artikelidentifikation als interne Shop-Identifikationsnummer (oxid) genutzt. Der Shop verwaltet die eindeutigen Shop-Identifikationsnummern selbst, daher sollte die Option mit Bedacht genutzt werden. Zusätzlich das Identfeld mit MD5 codieren Damit kann ein ähnlicher Ident wie bei einer oxid erzeugt werden. Diese Option greift nur mit der aktiven Option Artikelidentifikationsfeld als Ident (Datenfeld &quot;oxid&quot;) nutzen. Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Konfiguration\/Artikel_Ident_Optionen.html"},{"title":"Mall (nur EE)","text":"Diese Seite betrifft nur EE-Funktionalität. Spaltenzuordnung Setzen Sie die CSV-Spalte mit einer Liste von beliebig vielen Shop-ID's. Z.B. 1,2,3,4,5,6... interne Spaltentrennung Sofern mehr als ein Shop zugeordnet wird, geben Sie das verwendete Trennzeichen an.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Mall.html"},{"title":"Import","text":"Wenn Sie nun alle Einstellungen gespeichert haben, können Sie den Artikelimport starten. Danach zeigt Ihnen der Import, wie viele Zeilen aus Ihrer CSV-Datei importiert wurden, sowie das Ergebnis der bearbeiteten Artikel.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/Import.html"},{"title":"Nach Import","text":"Sie sehen eine Übersicht, wie viele Artikel bereits mit diesem Profil bearbeitet wurden. (Die Informationen orientieren sich an Einträgen aus der Spalte d3importprofileid in oxarticles.) Folgende Einstellungen können Sie vornehmen: Artikel pro Durchlauf Legen Sie fest, wie viele Zeilen pro Durchlauf geladen werden sollen. Wenn Sie z.B. 100 eintragen, werden die ersten 100 Artikel bearbeitet. Danach wird die untere Seite neu geladen und die nächsten 100 Artikel werden bearbeitet. Alle Artikel deaktivieren - deaktiviert alle Artikel 1. Alle Artikel löschen - löscht alle Artikel 1. 1. Betrifft Artikel, welche mit dem letztem Import dieses Profils nicht aktualisiert wurden. Wurde ein Artikel bereits mit einem anderen Profil bearbeitet, wird dieser nicht beeinflusst.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Artikelimport\/nach_Import.html"},{"title":"Upload der Bilder in das Importverzeichnis","text":"wichtiger Hinweis: Der Artikelimport muss vor einem Bilderimport durchgeführt werden. Siehe Artikelfelder: Abschnitt Bild 1-10 Öffnen Sie das sFTP-Programm und begeben Sie in das Shoproot Verzeichnis. Wechseln Sie in das Verzeichnis: \/source\/import\/pictures\/ und laden Sie die Bilder hoch. Extern definierte Bilder werden im Admin (oder per Cronjob) vom Modul in das Verzeichnis \/source\/import\/pictures\/ heruntergeladen. Mehr dazu unter Bilderimport \/ Import. Weitere Informationen finden Sie unter Häufig gestellte Fragen","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Bilderimport\/Upload_Bilder_in_Importverzeichnis.html"},{"title":"Stamm","text":"Importiere Wählen Sie ein Bild Importfeld n in dem Dropdown Feld aus. Dieses wurde von Ihnen unter Artikelimport \/ Artikelfelder zugeordnet. Danach wählen Sie für das Bild Importfeld n das zugehörige Ziel aus (Thumbnail, Icon, Bild 1-10). Nach jedem Speichern öffnet sich ein neues Feld für die Zuordnung. Start des nächsten Bilddurchlaufes Mit den Einstellungen nach 50 gelesenen Bildern bzw. nach 10 importierten Bildern können Sie den Start des folgenden Import-Durchlaufs regulieren. (Bei leistungsstarken Servern können die Einstellungen ggf. höher gesetzt werden.) lokale Bilder (\/import\/pictures\/) durch Externe überschreiben? Aktiv: Sofern ein externes Bild den gleichen Namen hat, wird das lokale Bild überschrieben. Inaktiv: Sofern ein externes Bild den gleichen Namen und eine unterschiedliche Größe zu dem lokalen Bild hat, wird der Name des externen Bilds mit einem Zusatz (DateinameZusatz.Endung) versehen. Masterbilder am Artikel vorher entfernen (empfohlen) Aktivieren Sie diese Option, um Bilder-Altlasten auf dem Server zu vermeiden. Während des Importvorgangs werden vorherige Artikelbilder über die Shop Logik entfernt. Die Löschung umfasst die Bilder des aktuellen Artikels im &quot;\/master\/&quot; und die generierten Bilder im &quot;\/generated\/&quot; Verzeichnis. Deaktivieren Sie diese Option, so werden die Bilder direkt importiert. Es können dabei in den \/source\/out\/master\/product\/*\/ Verzeichnissen ungenutzte Bilddateien entstehen. Aktion nachdem ein Bild importiert wurde Wählen Sie eine entsprechende Option aus, damit die Bilder im \/source\/import\/pictures\/ Verzeichnis gelöscht oder in ein anzugebendes Verzeichnis verschoben werden. Das Verzeichnis ist mit absolutem Pfad anzugeben, bspw: \/var\/www\/myshop.de\/{VerzeichnisName}\/ Klicken Sie abschließend auf Speichern.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Bilderimport\/Stamm.html"},{"title":"Import","text":"Wenn Sie externe Bilder importieren möchten, aktivieren Sie die Option Externe Bilder einlesen. Klicken Sie danach auf Bildimportverzeichnis einlesen. Damit werden die Artikelbilder (von extern heruntergeladen, wenn aktiv und) für den Import registriert. Wenn alle Bilddateien korrekt in der Verzeichnis-Info gezeigt werden, können Sie den Bildimport starten. Der Vorgang liest die Metadaten des Bildes und übergibt Sie geordnet dem Shop-Framework. Der Shop versetzt das Bild in das korrekte Verzeichnis.","tags":"","url":"manual\/Bedienungsanleitung\/Importanleitung_ausfuehrlich\/Bilderimport\/Import.html"},{"title":"Einleitung","text":"Ein Cronjob ist eine zeitlich wiederkehrende Aufgabe, die auf dem eingesetzten System\/Server gestartet wird. Der Importer unterstützt die Funktion. Ein Cronjob der über die Konsole eines Systems (nicht via HTTP Aufruf!) eingerichtet wird, hat meist weniger serverseitige Limitierungen als ein Webaufruf (Shop-Admin). Je nach Größe der CSV-Datei und Menge der Artikelbilder stellt dieser Vorgang einen hohen Anspruch an die Systemressourcen. Wichtiger Hinweis: Für die korrekte Einrichtung der Dateien bzw. der Cronjobs selbst, ist ein gewisses technisches Verständnis notwendig. Führen Sie die Einrichtung nur aus, wenn Sie über dieses Wissen verfügen. Alternativ sollte Ihr betreuender OXID-Partner die Einrichtung des Cronjobs übernehmen. Worin besteht der Unterschied zum Import via Shop-Admin? Im Shop-Admin wird die gesamte CSV-Datei in kleineren Teilen bzw. Durchläufen importiert. Dabei werden pro Durchlauf die eingestellte Menge an CSV-Zeilen verarbeitet. Diese Unterteilung reduziert die benötigten Ressourcen pro Aufruf. Für einen Cronjob gelten andere bzw. geringere Beschränkungen. Das ermöglicht einem Konsolen-Aufruf mehr Ressourcen für den Import zu verwenden. Jeder eingerichtete Import-Cronjob arbeitet alle CSV-Zeilen auf einmal ab. Hinweise Sprechen Sie die Details zum Einrichten eines Cronjobs mit Ihrem Serverprovider ab. Es gibt für die Einrichtung via Konsole verschiedene Faktoren, die je nach Serverprovider unterschiedlich sein können. Generell empfehlen wir den Einsatz von Import-Cronjobs auf eigenen Serverumgebungen. Managed-\/Hosting Pakete unterliegen meist strengeren Beschränkungen. Weiterhin sollte bei der Planung eines Cronjobs, der Einsatz von geringeren Datenmengen bevorzugt werden. Ein Beispiel wäre der Abgleich des Lagerbestandes oder der Preise. Ein Gegenbeispiel ist ein kompletter Import mit Artikel- inkl. Bilddaten. Als Eckpunkte kann man sich an der Anzahl der CSV-Spalten + CSV-Zeilen + Größe der Importdatei orientieren. Es empfiehlt sich die Ausführung des Imports innerhalb der Ruhezeiten (wenige Besucher) im Shop durchzuführen (bspw. in der Nacht). Je nach System kann es kurzfristig zu serverseitigen Auslastungen kommen (RAM, CPU). Um mehrere Importprofile per Cronjob ausführen lassen zu können, muss für jedes Profil eine neuer, eigener Eintrag (Shell-Datei, Crontab Zeile) angelegt werden. logischer Ablauf eines Cronjobs Starten des Artikelimports Starten der &quot;Nach Import&quot; Funktion (optional) Herunterladen der externen Bilder (optional) Starten des Bilderimports (optional)","tags":"","url":"manual\/Bedienungsanleitung\/Cronjob_Einrichtung\/Einleitung.html"},{"title":"Grundsätzliche Informationen","text":"Die anzusprechende Datei befindet sich unter: {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php Die Cronjob-Datei kann folgende Parameter (Reihenfolge beachten!) entgegennehmen: 1. Profil-ID Anhand der ID wird das dazugehörige Importprofil aus der Datenbank geladen. Die Profil-ID des Importprofils finden Sie im Shop-Admin. Wählen Sie unter \/Importer\/Artikelimport\/ das gewünschte Importprofil aus und gehen Sie auf den Reiter [Stamm]. Dort finden Sie die Ident in der Zeile [Profil-ID]. Dieser Parameter muss immer übergeben werden. 2. Aktion des Nach Imports Mit diesem Parameter kann die Aktion des Nach Imports gesteuert werden. Folgende Aktionen stehen Ihnen optional zur Verfügung: inactive Diese Aktion steuert dieselbe Funktion wie im Admin unter \/D³ Module\/Importer\/Artikelimport\/Nach Import\/Alle Artikel deaktivieren an. delete Diese Aktion steuert dieselbe Funktion wie im Admin unter \/D³ Module\/Importer\/Artikelimport\/Nach Import\/Alle Artikel löschen an. none (oder frei lassen) Es wird keine \"Nach Import\" Aktion angesteuert. Mehr Informationen zu den \"Nach Import\" Funktionen finden Sie hier 3. Shop-Id (nur EE) In der Shop Edition Enterprise können Sie diesen Parameter verwenden, um einen Import Vorgang innerhalb eines definierten Subshops zu starten. Folgende Ausgaben werden bei einem erfolgreichen Aufruf produziert (kann variieren): 2019-11-29 12:47:37: Starting database article import... 2019-11-29 12:47:38: Imported: 0 articles 2019-11-29 12:47:38: Updated: 10 articles 2019-11-29 12:47:40: starting picture import. 2019-11-29 12:47:40: start picture download. 2019-11-29 12:53:31: Downloaded: 30 pictures 2019-11-29 12:53:31: Reading picture directory... 2019-11-29 12:53:32: start importing pictures. 2019-11-29 12:53:36: finished picture import. 2019-11-29 12:53:36: Handled: 30 Pictures Bilderimport Der Bilderimport wird immer abhängig von den Einstellungen am Importprofil durchgeführt. Ausgenommen sind die Limitierungen des Bilderimports (siehe &quot;Start des nächsten Bilddurchlaufes&quot; unter Bilderimport).","tags":"","url":"manual\/Bedienungsanleitung\/Cronjob_Einrichtung\/Grundsaetzliche_Informationen.html"},{"title":"Einrichtung per Crontab","text":"Aufbau eines Cronjobs in crontab: # Minute Hour Day of Month Month Day of Week Command # (0-59) (0-23) (1-31) (1-12 or Jan-Dec) (0-6 or Sun-Sat) 0 2 12 * * \/usr\/bin\/find Tragen Sie bei {Shoproot} den absoluten Pfad zum Shop Hauptverzeichnis ein. Beispiel 1 In diesem Beispiel werden die CSV-Daten mit der Profil-ID &quot;smf5cf2bb7668594e9e7c37a7698f725&quot; und der &quot;Nach Import&quot; Funktion &quot;Alle Artikel deaktivieren&quot; ausgeführt. Die Zeitangabe entspricht &quot;jeden Tag um Mitternacht&quot;: 0 0 * * * Bei pfad\/zu\/php sollte die vom Shop verwendete PHP Version genutzt werden. Bspw.: \/usr\/local\/php7.2\/bin\/php 0 0 * * * pfad\/zu\/php {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php smf5cf2bb7668594e9e7c37a7698f725 inactive Beispiel 2 In diesem Beispiel werden die CSV-Daten mit der Profil-ID &quot;smf5cf2bb7668594e9e7c37a7698f725&quot; und ohne &quot;Nach Import&quot; Funktion ausgeführt. Die Zeitangabe entspricht &quot;jede volle Stunde&quot;: 0 * * * * 0 * * * * pfad\/zu\/php {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php smf5cf2bb7668594e9e7c37a7698f725 Beispiel 3 (nur EE) In diesem Beispiel werden die CSV-Daten mit der Profil-ID &quot;smf5cf2bb7668594e9e7c37a7698f725&quot;, ohne &quot;Nach Import&quot; Funktion ausgeführt und in den Subshop 3 importiert. Die Zeitangabe entspricht &quot;Zur vollen Stunde und in der 30. Minute&quot;: 0,30 * * * * 0,30 * * * * pfad\/zu\/php {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php smf5cf2bb7668594e9e7c37a7698f725 none 3","tags":"","url":"manual\/Bedienungsanleitung\/Cronjob_Einrichtung\/Einrichtung_per_Crontab.html"},{"title":"Anlage einer Shell Datei","text":"Der Pfad zu einer Shell Datei kann im Crontab oder in einer Server Configuration (Profihost: ServerCon) hinterlegt werden. Welches Importprofil per cronjob ausgeführt wird, wird in der .sh-Datei (bzw. bei Windowssystemen mit der .bat-Datei) gesteuert. Ebenso die Nach Import-Aktion. Tragen Sie bei {Shoproot} den absoluten Pfad zum Shop Hauptverzeichnis ein. Beispiel 1: !\/bin\/bash pfad\/zu\/php {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php smf5cf2bb7668594e9e7c37a7698f725 In diesem Beispiel wird das Profil mit der Profil-ID &quot;smf5cf2bb7668594e9e7c37a7698f725&quot; und ohne &quot;Nach Import&quot;-Aktion ausgeführt. Beispiel 2: !\/bin\/bash pfad\/zu\/php {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php smf5cf2bb7668594e9e7c37a7698f725 delete In diesem Beispiel wird das Profil mit der Profil-ID &quot;smf5cf2bb7668594e9e7c37a7698f725&quot; und als &quot;Nach Import&quot;-Aktion das Löschen nicht geänderter Artikel ausgeführt. Beispiel 3 (nur EE): !\/bin\/bash pfad\/zu\/php {Shoproot}\/source\/modules\/d3\/importer\/public\/d3_importer_cron.php smf5cf2bb7668594e9e7c37a7698f725 inactive 3 In diesem Beispiel wird das Profil mit der Profil-ID &quot;smf5cf2bb7668594e9e7c37a7698f725&quot; und als Nach Import-Aktion das Deaktivieren nicht geänderter Artikel, im Subshop &quot;3&quot; ausgeführt. Die korrekte Konfiguration der .sh-Datei kann über einen manuellen Testlauf per Konsole am Webserver geprüft werden.","tags":"","url":"manual\/Bedienungsanleitung\/Cronjob_Einrichtung\/Einrichtung_per_Shell.html"},{"title":"Einrichtung per Web-Aufruf","text":"Wie bereits in der Einleitung erwähnt, sind die Ressourcen via Web-Aufruf stärker limitiert. Daher wird diese Ausführung derzeit nicht unterstützt und nicht empfohlen.","tags":"","url":"manual\/Bedienungsanleitung\/Cronjob_Einrichtung\/Einrichtung_per_Web_Aufruf.html"},{"title":"Häufig gestellte Fragen","text":"Kann ich mit Ihrem Modul ein tägliches Update meiner Artikeldaten durchführen? Ja, Sie können so oft Sie möchten, einen Import durchführen. Ich habe eine CSV-Datei mit ca. 50.000 Artikeln.Ist ein Import mit diesem Modul möglich oder würde es zu einer Zeitüberschreitung und einem Abbruch beim Import kommen? Ein Import ist in jedem Fall möglich. Das Modul importiert Teile Ihrer Importdatei. Die Größe der Teile können Sie unter \/Artikelimport\/Konfig.\/Dateizeilen pro Durchlauf\/ einstellen. Die Serverkonfiguration (RAM\/CPU\/etc.) spielt dabei eine Rolle. Der Importer kann in 3 Kategorien die Artikel integrieren, ist das auch in Treppenkategorien möglich? Sie können den Artikeln beliebig vielen Kategorien zuordnen. Auch können Sie damit gleich den kompletten Kategoriebaum (Treppenkategorie) zuordnen. Die CSV-Datei meines Lieferanten enthält zusätzlichen HTML-Code für den Artikellangtext. Dabei kommen die im Admin definierten Trennzeichen ; und \" vor. Kann der Importer die Daten sauber verarbeiten? Ja, wenn die Trennzeichen (Datei-Spaltentrennung + Texttrenner) eindeutig vergeben werden und die Kombination \";\" nicht im Langtext vorkommt. Können auch andere Dateiformate importiert werden (wie xml, xls,...)? Nein, es werden lediglich csv-basierte Textdateien unterstützt. Muss ich alle Bildgrößen einzeln importieren? Nein, das Artikelbild wird bei dem Import dem Shop als Masterbild übergeben. Der Shop generiert aus dem Masterbild die restlichen Bilder. Wie erfolgt die Angabe der Staffelpreise für \"abs\" und \"%Rabatt\"? Die Angabe des Staffelpreises kann mit \"%\" oder per Option \"ist % Rabatt Preis?\" erfolgen. Dabei ist es egal ob \"10%\" oder \"%10\".","tags":"","url":"manual\/Bedienungsanleitung\/Haeufig_gestellte_Fragen.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserem HelpCenter zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr D³-Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}